src/main/java/ok/dht/test/slastin/reports/stage1/wrk2/putsu-10000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 3.235ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.42ms    4.31ms  53.89ms   96.75%
    Req/Sec    10.54k     1.51k   29.44k    91.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  693.00us
 75.000%    1.00ms
 90.000%    1.58ms
 99.000%   26.83ms
 99.900%   46.49ms
 99.990%   53.50ms
 99.999%   53.89ms
100.000%   53.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.035     0.000000            3         1.00
       0.184     0.100000        50158         1.11
       0.313     0.200000       100287         1.25
       0.441     0.300000       150259         1.43
       0.567     0.400000       200094         1.67
       0.693     0.500000       250103         2.00
       0.756     0.550000       275261         2.22
       0.818     0.600000       300224         2.50
       0.880     0.650000       325333         2.86
       0.941     0.700000       350226         3.33
       1.002     0.750000       375449         4.00
       1.031     0.775000       387639         4.44
       1.060     0.800000       400176         5.00
       1.088     0.825000       412595         5.71
       1.123     0.850000       425085         6.67
       1.316     0.875000       437510         8.00
       1.443     0.887500       443776         8.89
       1.577     0.900000       450030        10.00
       1.719     0.912500       456276        11.43
       1.874     0.925000       462516        13.33
       2.032     0.937500       468779        16.00
       2.111     0.943750       471907        17.78
       2.265     0.950000       475009        20.00
       2.485     0.956250       478119        22.86
       3.875     0.962500       481245        26.67
       6.359     0.968750       484373        32.00
       7.839     0.971875       485935        35.56
      10.527     0.975000       487495        40.00
      13.447     0.978125       489057        45.71
      16.263     0.981250       490624        53.33
      19.279     0.984375       492191        64.00
      20.783     0.985938       492966        71.11
      22.815     0.987500       493745        80.00
      25.247     0.989062       494527        91.43
      28.127     0.990625       495307       106.67
      31.183     0.992188       496088       128.00
      32.287     0.992969       496485       142.22
      33.663     0.993750       496875       160.00
      35.423     0.994531       497264       182.86
      37.279     0.995313       497654       213.33
      38.783     0.996094       498046       256.00
      39.359     0.996484       498237       284.44
      40.479     0.996875       498432       320.00
      41.503     0.997266       498632       365.71
      42.367     0.997656       498823       426.67
      43.103     0.998047       499018       512.00
      43.391     0.998242       499115       568.89
      44.127     0.998437       499215       640.00
      45.055     0.998633       499311       731.43
      45.887     0.998828       499411       853.33
      46.623     0.999023       499509      1024.00
      46.783     0.999121       499556      1137.78
      47.007     0.999219       499606      1280.00
      47.807     0.999316       499653      1462.86
      48.927     0.999414       499701      1706.67
      49.951     0.999512       499749      2048.00
      50.559     0.999561       499775      2275.56
      51.039     0.999609       499799      2560.00
      51.615     0.999658       499823      2925.71
      52.127     0.999707       499847      3413.33
      52.543     0.999756       499871      4096.00
      52.799     0.999780       499884      4551.11
      53.023     0.999805       499896      5120.00
      53.247     0.999829       499908      5851.43
      53.343     0.999854       499920      6826.67
      53.407     0.999878       499932      8192.00
      53.471     0.999890       499939      9102.22
      53.535     0.999902       499947     10240.00
      53.567     0.999915       499951     11702.86
      53.631     0.999927       499959     13653.33
      53.663     0.999939       499964     16384.00
      53.695     0.999945       499966     18204.44
      53.727     0.999951       499971     20480.00
      53.759     0.999957       499975     23405.71
      53.759     0.999963       499975     27306.67
      53.791     0.999969       499978     32768.00
      53.823     0.999973       499983     36408.89
      53.823     0.999976       499983     40960.00
      53.823     0.999979       499983     46811.43
      53.855     0.999982       499986     54613.33
      53.855     0.999985       499986     65536.00
      53.887     0.999986       499990     72817.78
      53.887     0.999988       499990     81920.00
      53.887     0.999989       499990     93622.86
      53.887     0.999991       499990    109226.67
      53.887     0.999992       499990    131072.00
      53.887     0.999993       499990    145635.56
      53.887     0.999994       499990    163840.00
      53.919     0.999995       499993    187245.71
      53.919     1.000000       499993          inf
#[Mean    =        1.419, StdDeviation   =        4.309]
#[Max     =       53.888, Total count    =       499993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599991 requests in 1.00m, 38.34MB read
Requests/sec:   9999.81
Transfer/sec:    654.28KB